---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.DimRefsGroupMemberSketch
source: html/cf5c4359-aa1e-26dd-3624-913bce5efabb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.DimRefsGroupMemberSketch Property

A group member's sketch or family is constrained to an element that is not a member of the group. These constraints have been removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DimRefsGroupMemberSketch { get; }
```